# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.
2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.
2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.
2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.
2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.
2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.
2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.
2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.
2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.
2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.
2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [2]:
import pandas as pd
import numpy as np

### Assignment # 1

In [3]:
df = pd.DataFrame(np.arange(24).reshape(6,4))
print(df)

df2 = pd.DataFrame({'A':np.random.standard_normal(2),
'B':np.random.standard_normal(2),
'C':np.random.standard_normal(2),
'D':np.random.standard_normal(2)},index=["Y","Z"])
print(f"The value at Bth column at Y index is: ",df2["B"]["Y"])

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23
The value at Bth column at Y index is:  2.6162899906577017

### Assignment # 2

In [ ]:
df = pd.DataFrame(np.arange(15).reshape(5,3))
df["Products"] = df[0] * df[1]
df

    0   1   2  Products
0   0   1   2         0
1   3   4   5        12
2   6   7   8        42
3   9  10  11        90
4  12  13  14       156

In [40]:
df = pd.DataFrame(np.arange(12).reshape(4,3))
df["row-wise sum"] = df[0]+df[1]+df[2]
df.loc["column-wise sum", [0,1,2,"row-wise sum"]] = [sum(df[0]) , sum(df[1]) , sum(df[2]) , sum(df["row-wise sum"])]
df

                    0     1     2  row-wise sum
0                 0.0   1.0   2.0           3.0
1                 3.0   4.0   5.0          12.0
2                 6.0   7.0   8.0          21.0
3                 9.0  10.0  11.0          30.0
column-wise sum  18.0  22.0  26.0          66.0

### Assignment # 3

In [ ]:
df = pd.DataFrame(np.arange(15).reshape(5,3))
df.loc[3, 0] = np.nan
df.loc[1, 1] = np.nan
df.loc[2, 2] = np.nan
df.fillna(df.mean(),inplace=True)
df

       0      1     2
0   0.00   1.00   2.0
1   3.00   7.75   5.0
2   6.00   7.00   8.0
3   5.25  10.00  11.0
4  12.00  13.00  14.0

In [ ]:
df = pd.DataFrame(np.arange(24).reshape(6,4))
df.loc[3, 0] = np.nan
df.loc[1, 1] = np.nan
df.loc[2, 2] = np.nan
df.dropna()

      0     1     2   3
0   0.0   1.0   2.0   3
4  16.0  17.0  18.0  19
5  20.0  21.0  22.0  23

### Assignment # 4

In [ ]:
df = pd.DataFrame({"Category": ['Shoes', 'Shoes', 'Shoes', 'Shirt', 'Shirt', 'Pant', 'Pant', 'Pant'],
                   "Value": [100,2000,213,234,546,54,343,4344]})
df.groupby("Category").sum()

          Value
Category
Pant       4741
Shirt       780
Shoes      2313

In [100]:
df = pd.DataFrame({"Category": ['Shoes', 'Shoes', 'Shoes', 'Shirt', 'Shirt', 'Pant', 'Pant', 'Pant'],
                   "Value": [100,2000,213,234,546,54,343,4344],
                   "Sales": [2,4,5,6,7,8,9,2]})
df['Total Sales'] = df['Value']*df['Sales']
df.groupby("Category")['Total Sales'].sum()

Category
Pant     12207
Shirt     5226
Shoes     9265
Name: Total Sales, dtype: int64

### Assignment # 5

In [ ]:
df1 = pd.DataFrame({"Name" : ["Taha", "Ali", "Warisha", "Fatima"],
              "Class" : [1,2,3,4]})

df2 = pd.DataFrame({"Name" : ["Riaz", "Amama", "Javeria", "Arhum"],
              "Class" : [1,2,3,4]})

mergedDf = pd.merge(df1,df2, on = "Class")
mergedDf

    Name_x  Class   Name_y
0     Taha      1     Riaz
1      Ali      2    Amama
2  Warisha      3  Javeria
3   Fatima      4    Arhum

In [104]:
df1 = pd.DataFrame({"Name" : ["Taha", "Ali", "Warisha", "Fatima"],
              "Class" : [1,2,3,4]})

df2 = pd.DataFrame({"Subject" : ["Math", "Science", "Sst", "History"],
              "Section" : ['A','B',"A","B"]})

pd.concat([df1,df2],axis = 1)

      Name  Class  Subject Section
0     Taha      1     Math       A
1      Ali      2  Science       B
2  Warisha      3      Sst       A
3   Fatima      4  History       B